In [197]:
import pandas as pd
import matplotlib.pyplot as plt

In [198]:
data = 'purchase_data.json'
df = pd.read_json(data)

df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [199]:
grouped_players = df.groupby('SN')
df1 = grouped_players.count()
total_p = df1['Age'].count()

total_players = pd.DataFrame({
    'Total Players': [total_p]
})

In [200]:
grouped_items = df.groupby('Item ID')
df1 = grouped_items.count()
unique_items = df1['Age'].count()

In [201]:
avg_price = round(df['Price'].mean(),2)
avg_price = '${:.2f}'.format(avg_price)

In [202]:
total_purchases = df['Item ID'].count()

In [203]:
total_revenue = df['Price'].sum()
total_revenue = '${:,.2f}'.format(total_revenue)

total_revenue

'$2,286.33'

In [204]:
purchasing_analysis_total = pd.DataFrame({
    'Number of Unique Items': [unique_items],
    'Average Price': [avg_price],
    'Number of Purchases': [total_purchases],
    'Total Revenue': [total_revenue]
})

purchasing_analysis_total = purchasing_analysis_total[
    [
        'Number of Unique Items', 
        'Average Price',
        'Number of Purchases',
        'Total Revenue'
    ]
]
purchasing_analysis_total

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $2.93                  780     $2,286.33

In [205]:
users = df.drop_duplicates('SN')

gender_counts = users['Gender'].value_counts()

male = gender_counts['Male']
female = gender_counts['Female']
other = gender_counts['Other / Non-Disclosed']

percent_male = round((male/total_p)*100,2)
percent_female = round((female/total_p)*100,2)
percent_other = round((other/total_p)*100,2)

In [206]:
gender_demographics = pd.DataFrame({
    'Gender': ['Male', 'Female', 'Other / Non-Disclosed'],
    'Percentage of Players': [percent_male, percent_female, percent_other],
    'Total Count': [male, female, other]
})

gender_demographics.set_index('Gender')

                       Percentage of Players  Total Count
Gender
Male                                   81.15          465
Female                                 17.45          100
Other / Non-Disclosed                   1.40            8

In [207]:
gender_counts = df['Gender'].value_counts()
gender_counts_df = gender_counts.to_frame()
gender_counts_df = gender_counts_df.rename(columns={'Gender':'Purchase Count'})

gender_counts_df

                       Purchase Count
Male                              633
Female                            136
Other / Non-Disclosed              11

In [208]:
gender = df.groupby('Gender')
gender_price = gender['Price'].mean()

gender_price_df = gender_price.to_frame()
gender_price_df['Price'] = gender_price_df['Price'].map('${:.2f}'.format)
gender_price_df = gender_price_df.rename(columns={'Price':'Average Purchase Price'})

gender_price_df

                      Average Purchase Price
Gender
Female                                 $2.82
Male                                   $2.95
Other / Non-Disclosed                  $3.25

In [209]:
gender_value = gender['Price'].sum()

gender_value_df = gender_value.to_frame()
gender_value_df['Price'] = gender_value_df['Price'].map('${:,.2f}'.format)
gender_value_df = gender_value_df.rename(columns={'Price':'Total Purchase Value'})

gender_value_df

                      Total Purchase Value
Gender
Female                             $382.91
Male                             $1,867.68
Other / Non-Disclosed               $35.74

In [210]:
df_reset_index = df.set_index('Gender')

df_male = df_reset_index.loc['Male']

df_male_users = df_male.groupby('SN')

df_male_value = df_male_users.sum()

male_normalized_total = df_male_value['Price'].mean()
male_normalized_total = '${:,.2f}'.format(male_normalized_total)

male_normalized_total

'$4.02'

In [211]:
df_female = df_reset_index.loc['Female']

df_female_users = df_female.groupby('SN')

df_female_value = df_female_users.sum()

female_normalized_total = df_female_value['Price'].mean()
female_normalized_total = '${:,.2f}'.format(female_normalized_total)

female_normalized_total

'$3.83'

In [212]:
df_other = df_reset_index.loc['Other / Non-Disclosed']

df_other_users = df_other.groupby('SN')

df_other_value = df_other_users.sum()

other_normalized_total = df_other_value['Price'].mean()
other_normalized_total = '${:,.2f}'.format(other_normalized_total)

other_normalized_total

'$4.47'

In [213]:
normalized_totals = pd.DataFrame({
    'Gender': ['Male', 'Female', 'Other / Non-Disclosed'],
    'Normalized Totals': [male_normalized_total, female_normalized_total, other_normalized_total]
})

normalized_totals_df = normalized_totals.set_index('Gender')

normalized_totals_df

                      Normalized Totals
Gender
Male                              $4.02
Female                            $3.83
Other / Non-Disclosed             $4.47

In [214]:
merge1 = gender_price_df.merge(gender_value_df, left_index=True, right_index=True)
merge1

                      Average Purchase Price Total Purchase Value
Gender
Female                                 $2.82              $382.91
Male                                   $2.95            $1,867.68
Other / Non-Disclosed                  $3.25               $35.74

In [215]:
merge2 = merge1.merge(gender_counts_df, left_index=True, right_index=True)

merge3 = merge2.merge(normalized_totals_df, left_index=True, right_index=True)

In [216]:
purchasing_analysis_gender = merge3[
    [
        'Purchase Count', 
        'Average Purchase Price',
        'Total Purchase Value',
        'Normalized Totals'
    ]
]
purchasing_analysis_gender

,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Totals
Female,136,$2.82,$382.91,$3.83
Male,633,$2.95,"$1,867.68",$4.02
Other / Non-Disclosed,11,$3.25,$35.74,$4.47

In [217]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, ((df['Age'].max())+1)]

labels = ['<10', '10-14', '15-19','20-24', '25-29', '30-34', '35-39', '40+']

SN = df.groupby('SN')
user_age = SN.max()

user_age

user_age['bin'] = pd.cut(user_age['Age'], bins, labels=labels )
user_age

bin_df = user_age['bin'].value_counts()
bin_df

age_count_df = bin_df.to_frame()
age_demographics = age_count_df.rename(columns={'bin':'Total Count'})

age_demographics['Percentage of Players'] = round((age_demographics['Total Count']/ total_p)*100,2)
age_demographics = age_demographics[['Percentage of Players', 'Total Count']]
age_demographics = age_demographics.reindex(labels)

age_demographics

       Percentage of Players  Total Count
<10                     3.32           19
10-14                   4.01           23
15-19                  17.45          100
20-24                  45.20          259
25-29                  15.18           87
30-34                   8.20           47
35-39                   4.71           27
40+                     1.92           11

In [218]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 200]

labels = ['<10', '10-14', '15-19','20-24', '25-29', '30-34', '35-39', '40+']

df["Age Bins"] = pd.cut(df["Age"], bins, labels=labels)

grouped_bins = df.groupby('Age Bins')
purchasing_analysis = grouped_bins['Item ID'].count()
purchasing_analysis = purchasing_analysis.to_frame()
purchasing_analysis = purchasing_analysis.rename(columns={'Item ID':'Purchase Count'})

purchasing_analysis

          Purchase Count
Age Bins
<10                   28
10-14                 35
15-19                133
20-24                336
25-29                125
30-34                 64
35-39                 42
40+                   17

In [219]:
grouped_bins = df.groupby('Age Bins')
average_pur_price = grouped_bins['Price'].mean()
average_pur_price = average_pur_price.to_frame()
average_pur_price['Price'] = average_pur_price['Price'].map('${:,.2f}'.format)

average_pur_price = average_pur_price.rename(columns={'Price':'Average Purchase Price'})

average_pur_price

         Average Purchase Price
Age Bins
<10                       $2.98
10-14                     $2.77
15-19                     $2.91
20-24                     $2.91
25-29                     $2.96
30-34                     $3.08
35-39                     $2.84
40+                       $3.16

In [220]:
grouped_bins = df.groupby('Age Bins')
total_pur_price = grouped_bins['Price'].sum()
total_pur_price = total_pur_price.to_frame()
total_pur_price['Price'] = total_pur_price['Price'].map('${:,.2f}'.format)
total_pur_price = total_pur_price.rename(columns={'Price':'Total Purchase Price'})


total_pur_price

         Total Purchase Price
Age Bins
<10                    $83.46
10-14                  $96.95
15-19                 $386.42
20-24                 $978.77
25-29                 $370.33
30-34                 $197.25
35-39                 $119.40
40+                    $53.75

In [221]:
df.head()

,Age,Gender,Item ID,Item Name,Price,SN,Age Bins
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,35-39
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,20-24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,30-34
3,21,Male,92,Final Critic,1.36,Pheusrical25,20-24
4,23,Male,63,Stormfury Mace,1.27,Aela59,20-24

In [222]:
df_reset_index = df.set_index('Age Bins')

df_lt10 = df_reset_index.loc['<10']

df_lt10_users = df_lt10.groupby('SN')

df_lt10_value = df_lt10_users.sum()

df_lt10_normalized_total = df_lt10_value['Price'].mean()
df_lt10_normalized_total = '${:,.2f}'.format(df_lt10_normalized_total)

# <10
df_lt10_normalized_total

'$4.39'

In [223]:
df_reset_index = df.set_index('Age Bins')

df_1014 = df_reset_index.loc['10-14']

df_1014_users = df_1014.groupby('SN')

df_1014_value = df_1014_users.sum()

df_1014_normalized_total = df_1014_value['Price'].mean()
df_1014_normalized_total = '${:,.2f}'.format(df_1014_normalized_total)

# 10-14
df_1014_normalized_total

'$4.22'

In [224]:
df_reset_index = df.set_index('Age Bins')

df_1519 = df_reset_index.loc['15-19']

df_1519_users = df_1519.groupby('SN')

df_1519_value = df_1519_users.sum()

df_1519_normalized_total = df_1519_value['Price'].mean()
df_1519_normalized_total = '${:,.2f}'.format(df_1519_normalized_total)

# 15-19
df_1519_normalized_total

'$3.86'

In [225]:
df_reset_index = df.set_index('Age Bins')

df_2024 = df_reset_index.loc['20-24']

df_2024_users = df_2024.groupby('SN')

df_2024_value = df_2024_users.sum()

df_2024_normalized_total = df_2024_value['Price'].mean()
df_2024_normalized_total = '${:,.2f}'.format(df_2024_normalized_total)

# 20-24
df_2024_normalized_total

'$3.78'

In [226]:
df_reset_index = df.set_index('Age Bins')

df_2529 = df_reset_index.loc['25-29']

df_2529_users = df_2529.groupby('SN')

df_2529_value = df_2529_users.sum()

df_2529_normalized_total = df_2529_value['Price'].mean()
df_2529_normalized_total = '${:,.2f}'.format(df_2529_normalized_total)

# 25-29
df_2529_normalized_total

'$4.26'

In [227]:
df_reset_index = df.set_index('Age Bins')

df_3034 = df_reset_index.loc['30-34']

df_3034_users = df_3034.groupby('SN')

df_3034_value = df_3034_users.sum()

df_3034_normalized_total = df_3034_value['Price'].mean()
df_3034_normalized_total = '${:,.2f}'.format(df_3034_normalized_total)

# 30-34	
df_3034_normalized_total

'$4.20'

In [228]:
df_reset_index = df.set_index('Age Bins')

df_3539 = df_reset_index.loc['35-39']

df_3539_users = df_3539.groupby('SN')

df_3539_value = df_3539_users.sum()

df_3539_normalized_total = df_3539_value['Price'].mean()
df_3539_normalized_total = '${:,.2f}'.format(df_3539_normalized_total)

# 35-39	
df_3539_normalized_total

'$4.42'

In [229]:
df_reset_index = df.set_index('Age Bins')

df_gt40 = df_reset_index.loc['40+']

df_gt40_users = df_gt40.groupby('SN')

df_gt40_value = df_gt40_users.sum()

df_gt40_normalized_total = df_gt40_value['Price'].mean()
df_gt40_normalized_total = '${:,.2f}'.format(df_gt40_normalized_total)

# 40+	
df_gt40_normalized_total

'$4.89'

In [235]:
pa_normalized_totals = pd.DataFrame({
    'Age Bins': labels,
    'Normalized Totals': [df_lt10_normalized_total, df_1014_normalized_total, 
                          df_1519_normalized_total, df_2024_normalized_total,
                          df_2529_normalized_total, df_3034_normalized_total,
                          df_3539_normalized_total, df_gt40_normalized_total]
})

pa_normalized_totals = pa_normalized_totals.set_index('Age Bins')
pa_normalized_totals

         Normalized Totals
Age Bins
<10                  $4.39
10-14                $4.22
15-19                $3.86
20-24                $3.78
25-29                $4.26
30-34                $4.20
35-39                $4.42
40+                  $4.89

In [ ]:
purchasing_analysis
average_pur_price
total_pur_price

In [237]:
merge1 = purchasing_analysis.merge(average_pur_price, left_index=True, right_index=True)
merge2 = merge1.merge(total_pur_price, left_index=True, right_index=True)
merge3 = merge2.merge(pa_normalized_totals, left_index=True, right_index=True)

purchasing_analysis_age = merge3.reindex(['10-14', '15-19','20-24', '25-29', '30-34', '35-39', '40+', '<10'])
purchasing_analysis_age

,Purchase Count,Average Purchase Price,Total Purchase Price,Normalized Totals
Age Bins,,,,
10-14,35,$2.77,$96.95,$4.22
15-19,133,$2.91,$386.42,$3.86
20-24,336,$2.91,$978.77,$3.78
25-29,125,$2.96,$370.33,$4.26
30-34,64,$3.08,$197.25,$4.20
35-39,42,$2.84,$119.40,$4.42
40+,17,$3.16,$53.75,$4.89
<10,28,$2.98,$83.46,$4.39

In [278]:
user_sn_counts = df['SN'].value_counts()
user_sn_counts = user_sn_counts.to_frame()
user_sn_counts = user_sn_counts.rename(columns={'SN':'Purchase Count'})

user_sn_counts.head()

             Purchase Count
Undirrala66               5
Saedue76                  4
Qarwen67                  4
Sondastan54               4
Mindimnya67               4

In [272]:
user_sn = df.groupby('SN')
avg_pur_pr = user_sn.mean()
avg_pur_pr = avg_pur_pr.rename(columns={'Price':'Average Purchase Price'})
avg_pur_pr = avg_pur_pr['Average Purchase Price'].to_frame() 
avg_pur_pr['Average Purchase Price'] = avg_pur_pr['Average Purchase Price'].map('${:,.2f}'.format)

avg_pur_pr.head()

             Average Purchase Price
SN
Adairialis76                  $2.46
Aduephos78                    $2.23
Aeduera68                     $1.93
Aela49                        $2.46
Aela59                        $1.27

In [283]:
user_sn = df.groupby('SN')
tot_pur_pr = user_sn.sum()
tot_pur_pr = tot_pur_pr.rename(columns={'Price':'Total Purchase Value'})
tot_pur_pr = tot_pur_pr['Total Purchase Value'].to_frame() 
tot_pur_pr['Total Purchase Value'] = tot_pur_pr['Total Purchase Value'].map('${:,.2f}'.format)

tot_pur_pr.head()

             Total Purchase Value
SN
Adairialis76                $2.46
Aduephos78                  $6.70
Aeduera68                   $5.80
Aela49                      $2.46
Aela59                      $1.27

In [309]:
merge1 = user_sn_counts.merge(avg_pur_pr, left_index=True, right_index=True)
merge1
merge2 = merge1.merge(tot_pur_pr, left_index=True, right_index=True)

merge2
#top_spenders = merge2.sort_values(by='Total Purchase Value', ascending=False)
#top_spenders

                 Purchase Count Average Purchase Price Total Purchase Value
Undirrala66                   5                  $3.41               $17.06
Saedue76                      4                  $3.39               $13.56
Qarwen67                      4                  $2.49                $9.97
Sondastan54                   4                  $2.56               $10.24
Mindimnya67                   4                  $3.18               $12.74
Hailaphos89                   4                  $1.47                $5.87
Isurria36                     3                  $3.67               $11.01
Lisossa63                     3                  $1.97                $5.92
Lirtosia72                    3                  $2.79                $8.37
Yadanun74                     3                  $3.03                $9.09
Mindirra92                    3                  $3.00                $9.01
Haellysu29                    3                  $4.24               $12.73
Chadossa56                    3                  $2.62                $7.85
Chadjask77                    3                  $3.34               $10.01
Isursti83                     3                  $3.68               $11.05
Chamistast30                  3                  $1.50                $4.49
Aerithllora36                 3                  $3.48               $10.45
Sondim43                      3                  $3.13                $9.38
Haerith37                     3                  $3.38               $10.14
Aduephos78                    3                  $2.23                $6.70
Frichosiala98                 3                  $2.98                $8.94
Yasriphos60                   3                  $3.47               $10.40
Ialistidru50                  3                  $2.45                $7.34
Frichaya88                    3                  $3.05                $9.16
Chanastsda67                  3                  $2.99                $8.96
Aeduera68                     3                  $1.93                $5.80
Eusri70                       3                  $3.52               $10.55
Lisistaya47                   3                  $3.06                $9.19
Eoda93                        3                  $3.86               $11.58
Seorithstilis90               3                  $2.80                $8.39
...                         ...                    ...                  ...
Assistasda90                  1                  $4.15                $4.15
Yarirarn35                    1                  $2.88                $2.88
Siasri67                      1                  $1.20                $1.20
Hirirap39                     1                  $2.33                $2.33
Silideu44                     1                  $1.77                $1.77
Tanimnya91                    1                  $1.73                $1.73
Ithesuphos68                  1                  $2.78                $2.78
Aillycal84                    1                  $4.00                $4.00
Ethralan59                    1                  $1.85                $1.85
Tyalaesu89                    1                  $2.78                $2.78
Phalinun47                    1                  $1.73                $1.73
Aisurphos78                   1                  $3.73                $3.73
Dyally87                      1                  $4.51                $4.51
Ililsan66                     1                  $1.03                $1.03
Aesty51                       1                  $1.82                $1.82
Yadacal26                     1                  $1.93                $1.93
Ryastycal90                   1                  $1.21                $1.21
Eolo46                        1                  $2.32                $2.32
Lamil79                       1                  $2.34                $2.34
Iasur80                       1                  $4.87                $4.87
Ialo60                        1                  $4.08                $4.08
Aelin32                       1                  $3.14                $3.14
Lassista97                    1                  $1.03                $1.03
Aenasu69                      1                  $3.27                $3.27
Philistirap41                 1                  $1.69                $1.69
Iskassa50                     1                  $1.79                $1.79
Eullydru35                    1                  $2.35                $2.35
Sondimla25                    1                  $2.17                $2.17
Malista67                     1                  $3.01                $3.01
Lirtossa84                    1                  $4.62                $4.62

[573 rows x 3 columns]

In [192]:
df.head()

,Age,Gender,Item ID,Item Name,Price,SN,Age Bins
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,35-39
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,20-24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,30-34
3,21,Male,92,Final Critic,1.36,Pheusrical25,20-24
4,23,Male,63,Stormfury Mace,1.27,Aela59,20-24